Repository: cassidyjames/principles
Catalog: po/*.po
Languages: fr, tr

source: Principles
fr: Principes

source: Remember Dieter Rams' ten principles of good design
fr: Rappelez-vous les dix principes de la conception de Dieter Rams
tr: Dieter Rams'ın on iyi tasarım ilkesini hatırlayın

source: According to Dieter Rams, good design is innovative, makes a product useful, is aesthetic, makes a product understandable, is unobtrusive, is honest, is long-lasting, is thorough down to the last detail, is environmentally-friendly, and is as little design as possible.
fr: Selon Dieter Rams, un bon design est innovant, rend un produit utile, esthétique, compréhensible, discret, honnête, durable, est travaillé jusque dans les moindres détails, le mieux integré dans son environnement et le plus léger possible.
tr: Dieter Rams'a göre iyi tasarım yenilikçidir, ürünü kullanışlı kılar,estetiktir, ürünü anlaşılır kılar, göze batmayan, dürüsttür,uzun ömürlü, en ince ayrıntısına kadar derinlemesine, çevreye duyarlıdostça ve olabildiğince sadedir

source: Get a simple reminder of one of these principles each time you open the app.
fr: Obtenez un simple rappel de l'un de ces principes à chaque fois que vous ouvrez l'application.
tr: Uygulamayı her açtığınızda bu ilkelerden birinin basit bir hatırlatıcısını alın.

source: Choose between a light or dark style
fr: Choisissez entre le thème clair ou sombre
tr: Açık veya koyu bir stil arasından seçim yapın

source: Applet stays on the bottom on all workspaces
fr: L'application reste en bas sur tous les espaces de travail
tr: Uygulama, tüm çalışma alanlarında en altta kalır

source: Automatically goes transparent when not focused
fr: Devient automatiquement transparente lorsqu'elle n'est pas au premier plan
tr: Odaklanmadığında otomatik olarak şeffaflaşır

source: Set to automatically start in System Settings → Applications → Startup
fr: Configuré pour démarrer automatiquement dans Paramètres du système → Applications → Démarrage
tr: Sistem Ayarları → Uygulamalar → Başlangıç'ta otomatik olarak başlayacak şekilde ayarlayın

source: Design Principles Viewer
fr: Visionneuse des principes de conception
tr: Tasarım İlkeleri Görüntüleyicisi

source: dieter;rams;design;aesthetic;guidelines;
fr: dieter;rams;conception;ésthétique;guide;
tr: ince yapılı; sert; tasarım; estetik; kurallar;

source: Load a random principle
fr: Charger un principe aléatoire
tr: Rastgele bir ilke yükle

source: Light background
fr: Thème clair
tr: Aydınlık arkaplan

source: Dark background
fr: Thème sombre
tr: Koyu arkaplan

source: Good design is innovative
fr: Un bon design est innovant
tr: İyi tasarım yenilikçidir

source: The possibilities for innovation are not, by any means, exhausted. Technological development is always offering new opportunities for innovative design. But innovative design always develops in tandem with innovative technology, and can never be an end in itself.
fr: Les possibilités d'innovation ne sont en aucun cas épuisées. Le développement technologique offre toujours de nouvelles opportunités pour une conception innovante. Mais la conception innovante se développe toujours en tandem avec les technologies innovantes, et ne peut jamais être une fin en soi.
tr: İnovasyon olanakları hiçbir şekilde tükenmez.Teknolojik gelişme her zaman için yeni fırsatlar sunaryenilikçi tasarım. Ancak yenilikçi tasarım her zaman aşağıdakilerle birlikte gelişir:yenilikçi teknoloji ve bitmeyen fikirler.

source: Good design makes a product useful
fr: Une bonne conception rend un produit utile
tr: İyi tasarım ürünü kullanışlı kılar

source: A product is bought to be used. It has to satisfy certain criteria, not only functional, but also psychological and aesthetic. Good design emphasizes the usefulness of a product whilst disregarding anything that could possibly detract from it.
fr: Un produit est acheté pour être utilisé. Il doit répondre à certains critères, non seulement fonctionnels, mais aussi psychologiques et esthétiques. Une bonne conception met l'accent sur l'utilité d'un produit tout en ne tenant pas compte de tout ce qui pourrait éventuellement lui nuire.
tr: Kullanılmak üzere bir ürün satın alınır. Yalnızca belirli kriterleri karşılamalı,işlevsel, aynı zamanda kullanışlı ve estetik. İyi bir tasarım içinolası herhangi bir şeyi göz ardı ederken bir ürünün kullanışlılığıküçültmeden yapılmalıdır

source: Good design is aesthetic
fr: Une bonne conception est ésthétique
tr: İyi tasarım estetiktir

source: The aesthetic quality of a product is integral to its usefulness because products we use every day affect our person and our well-being. But only well-executed objects can be beautiful.
fr: La qualité esthétique d'un produit fait partie intégrante de son utilité car les produits que nous utilisons tous les jours affectent notre personne et notre bien-être. Mais seuls des objets bien réalisés peuvent être beaux.
tr: Bir ürünün estetik kalitesi, kullanışlılığının ayrılmaz bir parçasıdır çünküher gün kullandığımız ürünler kişiligimiizi ve refahımızı etkiler. Ama yalnızcaiyi işlenmiş nesneler güzel olabilir.

source: Good design makes a product understandable
fr: Une bonne conception rend un produit compréhensible
tr: İyi tasarım bir ürünü anlaşılır kılar

source: It clarifies the product’s structure. Better still, it can make the product talk. At best, it is self-explanatory.
fr: Cela clarifie la structure du produit. Mieux encore, cela peut faire parler le produit. Au mieux, il est explicite.
tr: Ürünün yapısını netleştirir. Daha da iyisi, ürünü canlandırır.Hayat verir.

source: Good design is unobtrusive
fr: Une bonne conception est discrète
tr: İyi tasarım göze batmaz

source: Products fulfilling a purpose are like tools. They are neither decorative objects nor works of art. Their design should therefore be both neutral and restrained, to leave room for the user’s self-expression.
fr: Les produits qui remplissent une fonction sont comme des outils. Ce ne sont ni des objets décoratifs ni des œuvres d'art. Leur conception doit donc être à la fois neutre et sobre, afin de laisser à l'utilisateur la possibilité de s'exprimer.
tr: Bir amacı gerçekleştiren ürünler alet gibidir. Dekoratifnesnelerle sanat eserleri yaratılabilir. Bu nedenle tasarımları hem tarafsız hem dekullanıcının kendini ifade etmesinede olanak sağlar.

source: Good design is honest
fr: Une bonne conception est honnête
tr: İyi tasarım dürüsttür

source: It does not make a product more innovative, powerful or valuable than it really is. It does not attempt to manipulate the consumer with promises that cannot be kept.
fr: ELle ne rend pas un produit plus innovateur, plus puissant ou plus précieux qu'il ne l'est réellement. Elle ne vise pas à manipuler le consommateur avec des promesses qui ne peuvent être tenues.
tr: İyi bir ürünü kullanan kişi yenilikçi, güçlü veya değerli yapar.Ama manipüle etmez sır saklamaz.

source: Good design is long-lasting
fr: Une bonne conception est durable
tr: İyi tasarım uzun ömürlüdür

source: It avoids being fashionable and therefore never appears antiquated. Unlike fashionable design, it lasts many years—even in today’s throwaway society.
fr: Elle évite d'être tendance et n'apparaît donc jamais désuete. Contrairement a une conception tendance, Elle dure de nombreuses années, même dans la tendance actuelle du jetable.
tr: Moda olmaktan kaçınır ve bu nedenle asla modası geçmiş görünmez. Aksinemodaya uygun tasarım, neticelik katar kullanım ömrünü uzatır.

source: Good design is thorough down to the last detail
fr: Une bonne conception est travaillée jusque dans les moindres détails
tr: İyi tasarım en ince ayrıntısına kadar eksiksizdir

source: Nothing must be arbitrary or left to chance. Care and accuracy in the design process show respect towards the user.
fr: Rien ne doit être arbitraire ou laissé au hasard. Le soin et la précision dans le processus de conception font preuve de respect envers l'utilisateur.
tr: Hiçbir şey keyfi veya şansa bırakılmamalıdır. Tasarımda özen,doğrulukve disiplink gerektirir.

source: Good design is environmentally-friendly
fr: Une bonne conception s'intègre dans son environnement
tr: İyi tasarım çevre dostudur

source: Design makes an important contribution to the preservation of the environment. It conserves resources and minimizes physical and visual pollution throughout the lifecycle of the product.
fr: La conception apporte une contribution importante à la préservation de l'environnement. Elle préserve les ressources et minimise la pollution physique et visuelle tout au long du cycle de vie du produit.
tr: Tasarımın korunmasına önemli bir katkı sağlar.Çevre kaynaklarını korur, fiziksel ve görselliği en aza indirirürünün yaşam döngüsü uzatır.

source: Good design is as little design as possible
fr: Une bonne conception est la plus légère possible
tr: İyi fikirler bulmanın yolu, bir sürü fikir bulup kötülerini atmaktan geçer. (Linus Pauling)

source: Less, but better—because it concentrates on the essential aspects, and the products are not burdened with non-essentials. Back to purity, back to simplicity.
fr: Moins, mais mieux - parce qu'elle se concentre sur les aspects essentiels et que les produits ne sont pas surchargés avec ce qui n'est pas essentiel. Retour à la pureté, retour à la simplicité.
tr: Mükemmellik olağanüstü şeyler yapmakla değil, sıradan şeyleri olağanüstü iyi yapmakla elde edilir. (Angelique Arnauld)
